imported/solids4foam/tutorials/fluidSolidInteraction/oneWayCavity/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface    oneWayCoupling;

oneWayCouplingCoeffs
{
    // Solid patch list
    solidPatch interface;

    // Fluid patch list
    fluidPatch fixedWalls;

    // Interface transfer method
    interfaceTransferMethod directMap;
}

// ************************************************************************* //
